bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21G16A.PIC
      <edc:SFRDef edc:_addr="0x42002C34" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="COUNT" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C38" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PGE0" edc:desc="Pattern Generator 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE1" edc:desc="Pattern Generator 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE2" edc:desc="Pattern Generator 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE3" edc:desc="Pattern Generator 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE4" edc:desc="Pattern Generator 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE5" edc:desc="Pattern Generator 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE6" edc:desc="Pattern Generator 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE7" edc:desc="Pattern Generator 7 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV0" edc:desc="Pattern Generator 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV1" edc:desc="Pattern Generator 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV2" edc:desc="Pattern Generator 2 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV3" edc:desc="Pattern Generator 3 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV4" edc:desc="Pattern Generator 4 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV5" edc:desc="Pattern Generator 5 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV6" edc:desc="Pattern Generator 6 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV7" edc:desc="Pattern Generator 7 Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002C3A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42002C3C" edc:access="----nnnn----nnnn----nnnnn-nn-nnn" edc:cname="WAVE" edc:impl="0xF0F0FB7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DSCRITICAL" edc:desc="Dual-slope critical" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTTOM" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DSBOTH" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DSTOP" edc:desc="Dual-slope with interrupt/event condition when COUNT reaches TOP" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMP" edc:desc="Ramp Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RAMP1" edc:desc="RAMP1 operation" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2A" edc:desc="Alternative RAMP2 operation" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2" edc:desc="RAMP2 operation" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RAMP2C" edc:desc="Critical RAMP2 operation" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CIPEREN" edc:desc="Circular period Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN0" edc:desc="Circular Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN1" edc:desc="Circular Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN2" edc:desc="Circular Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CICCEN3" edc:desc="Circular Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="POL0" edc:desc="Channel 0 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL1" edc:desc="Channel 1 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL2" edc:desc="Channel 2 Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POL3" edc:desc="Channel 3 Polarity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SWAP0" edc:desc="Swap DTI Output Pair 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP1" edc:desc="Swap DTI Output Pair 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP2" edc:desc="Swap DTI Output Pair 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP3" edc:desc="Swap DTI Output Pair 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C40" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PER" edc:impl="0xFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C44" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC0" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C48" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC1" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C4C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC2" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C50" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CC3" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CC" edc:desc="Channel Compare/Capture Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002C54" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x42002C64" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATTBUF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PGEB0" edc:desc="Pattern Generator 0 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB1" edc:desc="Pattern Generator 1 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB2" edc:desc="Pattern Generator 2 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB3" edc:desc="Pattern Generator 3 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB4" edc:desc="Pattern Generator 4 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB5" edc:desc="Pattern Generator 5 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB6" edc:desc="Pattern Generator 6 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB7" edc:desc="Pattern Generator 7 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB0" edc:desc="Pattern Generator 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB1" edc:desc="Pattern Generator 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB2" edc:desc="Pattern Generator 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB3" edc:desc="Pattern Generator 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB4" edc:desc="Pattern Generator 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB5" edc:desc="Pattern Generator 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB6" edc:desc="Pattern Generator 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB7" edc:desc="Pattern Generator 7 Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002C66" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x42002C6C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PERBUF" edc:impl="0xFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
