bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/edc/ATSAMC21G16A.PIC
      <edc:SFRDef edc:_addr="0x42004C10" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WINUT" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Upper Threshold" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C14" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OFFSETCORR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Value" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C18" edc:access="--nnnnnnnnnnnnnn" edc:cname="GAINCORR" edc:impl="0x3FFF" edc:mclr="0000000000000001" edc:nzwidth="0x10" edc:por="0000000000000001" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Value" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C1A" edc:access="----nnnn" edc:cname="SHIFTCORR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="SHIFTCORR" edc:desc="Shift Correction Value" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004C1B" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42004C1C" edc:access="------nn" edc:cname="SWTRIG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="SDADC Flush" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start SDADC Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004C1D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004C20" edc:access="--------------------rrrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SWRST Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLC" edc:desc="CTRLC Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="INPUTCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINCTRL" edc:desc="WINCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="WINLT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="WINUT Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="OFFSETCTRL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="GAINCORR Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHIFTCORR" edc:desc="SHIFTCORR Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:desc="SWTRG Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANACTRL" edc:desc="ANACTRL Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C24" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RESULT" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Result Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="RESERVED" edc:desc="Reserved" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42004C28" edc:access="-----nnn" edc:cname="SEQCTRL" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="SEQEN" edc:desc="Enable Positive Input in the Sequence" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42004C29" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42004C2C" edc:access="nnnnnnnn" edc:cname="ANACTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDADC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDADC">
            <edc:SFRFieldDef edc:cname="CTRSDADC" edc:desc="SDADC Control" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ONCHOP" edc:desc="Chopper" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFTEST" edc:desc="BUFTEST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
